const String imgPath1 = "assets/images/img1.png";
const String imgPath2 = "assets/images/img2.png";
const String imgPath3 = "assets/images/img3.png";
const String imgPath4 = "assets/images/img4.png";
const String imgPath5 = "assets/images/img5.png";
const String imgPath7 = "assets/images/img7.png";
const String imgPath8 = "assets/images/img8.png";
const String imgPath9 = "assets/images/img9.png";
const String imgPath10 = "assets/images/img10.png";
const String imgPath11 = "assets/images/img11.png";

List<Map<String, dynamic>> keyamModel = [

  {
    "name":"المسئولية",
    "imagePath":"assets/images/img1.png",
    "description":"  المسئولية هـي ان يلزم الانسان نفسـه علـى تتميـم الاعمـال الواجبـة عليـه سـواء كان هنـاك مـن يحاسـبـه ام لا. إنهـا القـدرة علـى أن يفـي بالتزاماته المسؤولية هي الالتزام النابـع مـن داخـل الشخص لمـا عليه من الواجبات في كل مناحي الحياة الشخصية و العملية والاجتماعيـة والإنسانية و القومية.\n\nالمسئولية لا تحتاج لرقيـب خارجـي للقيـام بـهـا بـل هـي دافـع داخـلـي يجعـل كل شخص يتمـم عمـلـه حتـى ينعـم بالارتياح النفسـي، و هـي مسئولية الشخص عـن اختياراتـه، قراراتـه، عواطفـه و تصرفاتـه فـهـي المسئولية الكاملـة عـن الحـيـاة.",
  },
  {
    "name":"الصدق",
    "imagePath":"assets/images/img2.png",
    "description":"الصـدق هـو قـول الحـق ومطابقـة الـكلام للواقـع امـا الكـذب وهـو إمـا بتزييف الحقائق جزئيـا، أو كليـة او الخـداع لتحقيـق هـدف معيـن وقـد يـكـون ماديا ونفسيا واجتماعيـا وهـو عـكـس الصـدق. وقـد يقـتـرن بعـدد مـن الجرائـم مـثـل الغـش والنصـب والسرقة. وقـد يقترن ببعـض المهـن أو الادوار مثـل الدبلوماسية أو الحـرب النفسية الاعلاميـة. عكسه (الكذب، عدم الامانة) \n\n الصدق هو: قيمة أساسية للشخصية، هو استقرار وحفاظ للروح. ‘إنـه الدفـاع عـن النفـس.’ الصـدق هـو أكثـر مـن قـول الحقيقـة. انـه يتعامـل مـع الدوافـع والنوايـا، انـه صـوت فـي داخلـنـا يـوحـي بالحقيقـة بـدل مـن الكـذب الصـدق هـو ربمـا مـن أعـظـم القيـم الإنسانية وهـو الطريق الوحيـد للنجاة.",
  },
  {
    "name":"النزاهة",
    "imagePath":"assets/images/img3.png",
    "description":"تتضمن النزاهة معـانـي مثـل الاستقامة، العفـة، الأمانة، الشفافية. النزاهـة هـي أن يفكر الإنسـان ويسـلـك فـي حياتـه طبقـا لقيمـه الشخصية ومبادئـه ومـا يعتقد انه صحيح بعض النظـر عـن مـا سيكلفه ذلك فيقوم دائما يفعل الصحيح حتى لو لم يكن مراقبـا وحـتـي لـو كان الفعـل الصحيح هو الاختيار الأصعـب: فالمهـم أن يظل الإنسـان صادقا مع نفسـه ومـوفيـا لمـا يتعهـد بـه حتى ولـو واجـه فـي سـبيل ذلـك النتائج الوخيمـة \n\n النزاهة هي: التوافق بيـن اقـوال الإنسان و افعاله، فالإنسان النزيه يحافظ علـى وعـوده قـدر المستطاع, لا يخالف اعتقاداتـه وأقوالـه فالنزاهـة هـي الأمانـة فـي القول والفعل، والتوافق بينهما. أما الفساد فهو: الخلل والاضطراب والتلف و السرقة الفساد ايضا هو التخلـي عـن القيـم و المعتقدات لأجل المصلحـة و دفـع اخريـن للمشاركة في الاعمال المشبوهة، و تعد ظاهـره المسـاد مـن ابـرز المشكلات التي  اتفقت  تقارير الخبراء والمتخصصيـن علـي ضـرورة مكافحتهـا وتطويقهـا وعلاجهـا خـاصـة فـي الـدول الناميـة كهدف اساسـي لابـد مـن الحقيقـة",
  },
  {
    "name":"البساطة",
    "imagePath":"assets/images/img4.png",
    "description":"البساطة هـي العيـش بالعفوية وسلاسـة الطبـع وسلامة النيـة مـع البعـد عـن التعقيـد والسطحية، هي كل طبيعي وعفـوي لا خبث فيـه ولا مخادعة  هـي عـدم التصنع والتكلف عدم الفخفخـة والتباهي و حب  الظهـور\n\nالبساطة تضمن التحـرر مـن الهـم والقلق، لأن موقف البساطة الداخلي يتضمـن حيـاة عـدم الاهتمام بالممتلكات وهـذه الحريـة لا يعرفهـا الطماع ولا البخيل وليست لها علاقـة ابـدأ بوفرة الممتلكات أو الافتقار اليها.",
  },
  {
    "name":"التواضع",
    "imagePath":"assets/images/img5.png",
    "description":"التواضع هو: امتلاك القدرة على الاعتراف بالأخطاء ورؤية النفس على الدوام فـي حـال التعلـم مـن كل ما حولها، التواضـع هـو قبول الحـق والانقياد لـه و فـي نفس الوقت احترام الآخرين و أفكارهم وإبداعاتهم ، يوجـد تقليـد فـي بعـض شـركات اليابان، وهـو أن المديريـن فـي الإدارة العليا يستقبلون زملاءهـم الجـدد، في أول يـوم عـمـل حـيـث يقوم أولئك المديرون بمسح أحذية أولئك الموظفيـن الجـدد فالإدارة الحقيقية هي التـي تـعـرف كيف تديـر مـن يعمـلـون مـعـك علـى نحـو إنساني ومعرفي علمـي؟!! و التواضع لا يمس الكرامـة المـا يـؤدي إلـى احـتـرام اكثر لأنه مبني على تقبل و احترام الاخر، عكسه (الكبرياء) ",
  },
  {
    "name":"التعاون",
    "imagePath":"assets/images/img6.png",
    "description":"التعاون هـو: عمليـة، تواصلية، تبادليـة بين فردين أو أكثر لنقل الخبرات والمعـارف والأفكار والأدوات فـي سـبيل أداء كـفاء وفعـال ومتكامـل ونتائج فائقة.\n\nخلق الله تعالـي النـاس مختلفيـن فـي كـل شـيء سـواء فـي صفائهـم الجسدية والداخليـة والصفات الخلقية، كمـا أنـه قـد اعـطـى لـكل إنسـان مـن النـاس شيئا وهدية خاصـة بـه تسمى الموهبة، وقد توزعـت هـذه الهبات بـيـن النـاس بشكل يجعـل النـاس محتاجين لبعضهم البعـض فالهبـات وزعهـا الله تعالـى بيـن عبـاده بشكل يلبـي كافـة الاحتياجـات الضرورية للناس جميعا، فمـا يتقنـه شخص معين لا يتقنـه شـخص آخـر: فليس كل شخص كالآخـر فـي صفاته، ومـا يمتلكـه مـن مـواهـب وأمـور مختلفة ومتنوعـة.",
  },
  {
    "name":"الإتحاد",
    "imagePath":"assets/images/img7.png",
    "description":"الإتحـاد هـو الالتقاء حـول هـدف واحـد، رؤيـة مشتركة وحلـم مشـترك. فهو ارتباط مجموعـة مـن الأفراد علـى أسـاس مـن الحقوق والالتزامات المتساوية لمواجهـة وللتغلـب عـلـى مـا قـد يعترضهـم مـن المشاكل الاقتصادية أو الاجتماعية أو السياسية أو القانونية ذات الارتباط الوثيق المباشر بمستوى معيشتهم الاقتصادية والاجتماعيـة سـواء كانـوا منتجيـن أو مستهلكين.\n\nالإتحـاد قيمـة إيجابيـة إذ أن ما يستطيع الجميع فعلـه معـا مجتمعين أعظم بالضـرورة وأفضـل مـن مجمـوع مـا يفعلـه كـل علـى حدة، فالاتحاد هـو احترام للاختلافات والتنوعـات مـع استخدامها جميعا بتناغـم لتحقيـق هـدف يهتـم لـه الجميـع هـو مـا يستدعي وجـود قواعـد مسهلة للتفاعل والتعاون والتكامـل مـن جهـة، مع وجـود قيـم كالتضحيـة والصـدق مـن جهـة أخـرى، الإتحـاد هـو العيـش فـي انسجام مع النفـس ومـع الآخرين بمعنى العمـل علـى هـدف واحـد مـع هـؤلاء الذين يؤمـنـون أنـه إذا نجـح شخص فالكل قـد نجـح وأنـه إذا فشـل شـخص فقـد فـشـل الجميـع هـذا المعنـى للاتحاد مـهـم فـي بنـاء المجتمعات.",
  },
  {
    "name":"الاحترام",
    "imagePath":"assets/images/img8.png",
    "description":"هـو أحـد القيـم الحميـدة التـي يتميـز بـهـا الإنسان، ويعبـر عنـه تـجـاه كل شـيء حولـه أو يتعامـل مـعـه بـكل تقديـر وعنايـة والتـزام، فهـو تقديـر لقيمـة مـا أو لشـيء مـا أو لشخص مـا، وإحسـاس بقيمتـه وتميـزه، أو لنوعيـة الشـخصية، أو القدرة.",
  },
  {
    "name":"المحبة",
    "imagePath":"assets/images/img9.png",
    "description":"المحبـة هـي: قيمـة مركزيـة فـي الحيـاة، فمـن يـحـيـا بـهـا تصيـر معيارا وميزانـا يـزن بـه كل القرارات والأفعال والنشاطات والأفكار. والمحبة الصادقـة غيـر المشـروطة تتسع وتمتد لتشمل النفـس والغيـر مـن بشـر حـتـى الحيوانات والجمـاد يـكـون لـهـم نـصـيـب مـن المحبـة ومـن أهـم المؤشرات الدالـة علـى تبنـي قيمـة المحبـة إرادة الخيـر ونشره، والرحمـة والرفـق، والنفـور مـن الكراهيـة والإضرار بالنفـس أو الغيـر. \n\nامـا الكراهيـة فـهـي مشـاعر انسحابية يصاحبهـا اشمئزاز شـديد نفـور وعـداوة أو عـدم تعاطـف مـع شـخـص مـا أو شـيء أو حتـى ظاهـرة معينة، تعـوز عمومـا إلـى رغبـة فـي تجـنـب عـزل، نقـل أو تدميـر الشـيء المكـروه.",
  },
  {
    "name":"السلام",
    "imagePath":"assets/images/img10.png",
    "description":"السـلام هـو: الأمن والاطمئنان والخلـو مـن الخـوف والانزعاج والقلق والاضطراب، سـواء لأسباب خارجيـة أو لأسباب داخلية، كما أنه يعني النجاح والصحة والسعادة ماديا وجسمانيا ونفسيا. \n\nأما الاضطراب فهو نمط سيكولوجي أو سلوكي ينتج عـن الشعور بالضيق  أو العجـز الـذي يصيـب الفـرد ولا يعـد جـزءا مـن النمـو الطبيعـي للمهارات العقليـة أو الثقافـة.\n\nوهناك نوعان للسلام:\n\n- السلام الداخلي: الإحساس بالتناغـم والسـلام مـع النفـس وغيـاب المتناقضات الداخلية والسعادة والشعور بالحرية والسـلام الروحـي ومشـاعر التعاطف والتقدير، فـلا يتصارع الإنسـان مـع نفسـه ولـو بدافع إصلاحهـا بـل يحاول تفهـم مداخلها ودوافعها حتى يقودهـا إلى الخيـر فـي الـكـون. \n- السـلام الخارجـي او المجتمعـي: السـلام بـيـن كل إنسـان وآخـر والتناغـم فـي العلاقات الاجتماعيـة علـى جميع مستوياتها وحـل أي نزاعـات، والحـب والصـداقـة والوحـدة والفهـم المتبادل والتعـاون واحتواء الخلافات وتقبـل الاختلافـات. وتعـم هـذه النقطة لتشمل كل علاقات الإنسـان مـع غـيـره أنـا كان أو صديقا أو زميـلا فـي العمـل أو أي إنسان يجمعنـي مـعـه شـيء ..... الخ.\n\nوللسلام ثلاثـة انـواع اخـرى: السـلام مـع الله، السـلام مـع النفـس والسـلام مـع الاخرييـن. ",
  },
  {
    "name":"السعادة",
    "imagePath":"assets/images/img11.png",
    "description":"هـي حالـة ارتيـاب تـام وشعور داخلـي عميـق بالرضـا والقناعـة والسرور والانبساط، وهـي طـيـب النفـس وصـلاح الحـال. \nامـا التعاسـة فـهـي حالـة مـن الغـم والكآبـة يسببها مصـاب أو خسارة أو فـراق ونحو ذلـك مـا يخالج النفـس مـن ألـم أو انزعاج وعدم ارتياح، فقـدان الفـرح والسرور.\n\n السعادة هـي: القيمـة التي طالمـا بحـث عنهـا الإنسـان فـي كل العصور، ويحاول الإنسـان بـذل كل مـا يستطيع بذلـه مـن أجـل الحصول عليها، فيريـد الجميع أن يكونوا سعداء. لو سألت الناس ما هو طموحهـم الأول فـي الحيـاة، فإن معظمهـم سـوف يقولـون ‘نريد ان نكون سعداء فحسـب’.\n\n والسعادة قيمـة يعتبرها الكثيرون الكنز المفقود الـذي لا يمكـن الحصول عليـه فـي الدنيا، وذلك لتصـور سـيء عنها، بينما العقلاء يرون أن هـذه القيمـة أقرب للإنسـان مـن كل شـيء!! \n\nمن السهل ان تشعر بالسعادة عندما يسير كل شيء على طريقتنا لكـن مـاذا عـن بـاقـي حياتنا؟ ؟ لو كان الامـر كذلك، فسوف تشعر بالتعاسـة فـي اوقات كثيرة مـن حيـاتـك، و كـن كيف يمكننا أن نظـل ايجابييـن فـي عـالـم سـابي؟ كيف يمكننا ان نعيش متفائلين عندمـا ينهار كل شيء؟",
  },


];